/**
 * Created by Lenovo on 2016/8/26.
 */

angular.module('AdminApp').controller('TableCtrl', function ($rootScope,$scope) {

    $scope.gridOptions = {
        enableFiltering : true,
        enableGridMenu: true,
        enableColumnResizing: true,
        //showGridFooter: true,
        exporterMenuCsv: true,

        minRowsToShow : 15,
        paginationPageSizes: [15, 25, 50, 75],
        paginationPageSize: 15
    };

    $scope.gridOptions.onRegisterApi = function(gridApi){
        //set gridApi on scope
        $scope.gridApi = gridApi;
        gridApi.edit.on.afterCellEdit($scope,function(rowEntity, colDef, newValue, oldValue){
            $scope.$apply();
            alert('变化的行:' +　colDef.name + '\n变化内容:' + oldValue + ' => '+ newValue );
        });
    };

    $scope.gridOptions.columnDefs = [
        {
            name: '编号',
            width: 100
        },
        {
            name: '所属类别',
            width: 100
        },
        {
            name: '名称',
            width: 100
        },
        {
            name: '所属系统',
            width: 100
        },
        {
            name: '用途',
            width: 100
        },
        {
            name: '宿主机名',
            width: 100
        },
        {
            name: '宿主机IP',
            width: 100
        },
        {
            name: 'OA映射地址',
            width: 100
        },
        {
            name: '宿主机用途',
            width: 100
        },
        {
            name: '程序路径',
            width: 100
        },
        {
            name: '开发平台',
            width: 100
        },
        {
            name: '版本',
            width: 100
        },
        {
            name: '系统版本',
            width: 100
        },
        {
            name: '系统用户',
            width: 100
        },
        {
            name: '系统密码',
            width: 100
        },
        {
            name: '开发单位',
            width: 100
        },
        {
            name: '维护负责人',
            width: 100
        },
        {
            name: '物理地址',
            width: 100
        },
        {
            name: '主机型号',
            width: 100
        },
        {
            name: '基本配置',
            width: 100
        },
        {
            name: '用途',
            width: 100
        }

    ]

    var yizhuang = [
        {
            "编号": "1",
            "所属类别": "数据库",
            "名称": "CNTBC数据库",
            "所属系统": "开发库",
            "用途": "元数据数据库",
            "宿主机名":"DSS-META",
            "宿主机IP":"132.63.10.3",
            "OA映射地址":"",
            "宿主机用途":"元数据(EDW)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.23",
            "系统用户":"oracle",
            "系统密码":"metaoracle",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"HP RX6600",
            "基本配置":"4C/16G",
            "用途":""
        },
        {
            "编号": "2",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db31",
            "宿主机IP":"132.63.10.32",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP1)",
            "程序路径":"/oracle oracle10g安装程序",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "3",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db41",
            "宿主机IP":"132.63.10.33",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "4",
            "所属类别": "数据库",
            "名称": "DW",
            "所属系统": "ODS/4G/转售",
            "用途": "测试数据库，4G开发测试库",
            "宿主机名":"dss-db32",
            "宿主机IP":"132.63.10.34",
            "OA映射地址":"",
            "宿主机用途":"宽表测试库，4G数据库(DW1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle   ctgogg",
            "系统密码":"ora10gR2  vgCLB5kl",
            "开发单位":"亚联",
            "维护负责人":"张国庆",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "5",
            "所属类别": "数据库",
            "名称": "LSDB",
            "所属系统": "ODS",
            "用途": "宽表历史数据库，号码级历史库",
            "宿主机名":"dss-db42",
            "宿主机IP":"132.63.10.35",
            "OA映射地址":"",
            "宿主机用途":"历史库(lsdb)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora11gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256G",
            "用途":""
        },
        {
            "编号": "6",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node1",
            "宿主机名":"dss-db5",
            "宿主机IP":"132.63.10.63",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "7",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node2",
            "宿主机名":"dss-db6",
            "宿主机IP":"132.63.10.64",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "8",
            "所属类别": "数据库",
            "名称": "ODS",
            "所属系统": "ODS",
            "用途": "号码级数据库/全网枢纽/X86配置库node1",
            "宿主机名":"dss-db1",
            "宿主机IP":"132.63.10.8",
            "OA映射地址":"",
            "宿主机用途":"号码级数据库(ODS1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"oracleR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"",
            "基本配置":"",
            "用途":""
        },
        {
            "编号": "9",
            "所属类别": "数据库",
            "名称": "CNTBC数据库",
            "所属系统": "开发库",
            "用途": "元数据数据库",
            "宿主机名":"DSS-META",
            "宿主机IP":"132.63.10.3",
            "OA映射地址":"",
            "宿主机用途":"元数据(EDW)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.23",
            "系统用户":"oracle",
            "系统密码":"metaoracle",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"HP RX6600",
            "基本配置":"4C/16G",
            "用途":""
        },
        {
            "编号": "10",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db31",
            "宿主机IP":"132.63.10.32",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP1)",
            "程序路径":"/oracle oracle10g安装程序",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "11",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db41",
            "宿主机IP":"132.63.10.33",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "12",
            "所属类别": "数据库",
            "名称": "DW",
            "所属系统": "ODS/4G/转售",
            "用途": "测试数据库，4G开发测试库",
            "宿主机名":"dss-db32",
            "宿主机IP":"132.63.10.34",
            "OA映射地址":"",
            "宿主机用途":"宽表测试库，4G数据库(DW1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle   ctgogg",
            "系统密码":"ora10gR2  vgCLB5kl",
            "开发单位":"亚联",
            "维护负责人":"张国庆",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "13",
            "所属类别": "数据库",
            "名称": "LSDB",
            "所属系统": "ODS",
            "用途": "宽表历史数据库，号码级历史库",
            "宿主机名":"dss-db42",
            "宿主机IP":"132.63.10.35",
            "OA映射地址":"",
            "宿主机用途":"历史库(lsdb)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora11gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256G",
            "用途":""
        },
        {
            "编号": "14",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node1",
            "宿主机名":"dss-db5",
            "宿主机IP":"132.63.10.63",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "15",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node2",
            "宿主机名":"dss-db6",
            "宿主机IP":"132.63.10.64",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "16",
            "所属类别": "数据库",
            "名称": "ODS",
            "所属系统": "ODS",
            "用途": "号码级数据库/全网枢纽/X86配置库node1",
            "宿主机名":"dss-db1",
            "宿主机IP":"132.63.10.8",
            "OA映射地址":"",
            "宿主机用途":"号码级数据库(ODS1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"oracleR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"",
            "基本配置":"",
            "用途":""
        },
        {
            "编号": "17",
            "所属类别": "数据库",
            "名称": "CNTBC数据库",
            "所属系统": "开发库",
            "用途": "元数据数据库",
            "宿主机名":"DSS-META",
            "宿主机IP":"132.63.10.3",
            "OA映射地址":"",
            "宿主机用途":"元数据(EDW)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.23",
            "系统用户":"oracle",
            "系统密码":"metaoracle",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"HP RX6600",
            "基本配置":"4C/16G",
            "用途":""
        },
        {
            "编号": "18",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db31",
            "宿主机IP":"132.63.10.32",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP1)",
            "程序路径":"/oracle oracle10g安装程序",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "19",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db41",
            "宿主机IP":"132.63.10.33",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "20",
            "所属类别": "数据库",
            "名称": "DW",
            "所属系统": "ODS/4G/转售",
            "用途": "测试数据库，4G开发测试库",
            "宿主机名":"dss-db32",
            "宿主机IP":"132.63.10.34",
            "OA映射地址":"",
            "宿主机用途":"宽表测试库，4G数据库(DW1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle   ctgogg",
            "系统密码":"ora10gR2  vgCLB5kl",
            "开发单位":"亚联",
            "维护负责人":"张国庆",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "21",
            "所属类别": "数据库",
            "名称": "LSDB",
            "所属系统": "ODS",
            "用途": "宽表历史数据库，号码级历史库",
            "宿主机名":"dss-db42",
            "宿主机IP":"132.63.10.35",
            "OA映射地址":"",
            "宿主机用途":"历史库(lsdb)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora11gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256G",
            "用途":""
        },
        {
            "编号": "22",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node1",
            "宿主机名":"dss-db5",
            "宿主机IP":"132.63.10.63",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "23",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node2",
            "宿主机名":"dss-db6",
            "宿主机IP":"132.63.10.64",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "24",
            "所属类别": "数据库",
            "名称": "ODS",
            "所属系统": "ODS",
            "用途": "号码级数据库/全网枢纽/X86配置库node1",
            "宿主机名":"dss-db1",
            "宿主机IP":"132.63.10.8",
            "OA映射地址":"",
            "宿主机用途":"号码级数据库(ODS1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"oracleR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"",
            "基本配置":"",
            "用途":""
        },
        {
            "编号": "25",
            "所属类别": "数据库",
            "名称": "CNTBC数据库",
            "所属系统": "开发库",
            "用途": "元数据数据库",
            "宿主机名":"DSS-META",
            "宿主机IP":"132.63.10.3",
            "OA映射地址":"",
            "宿主机用途":"元数据(EDW)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.23",
            "系统用户":"oracle",
            "系统密码":"metaoracle",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"HP RX6600",
            "基本配置":"4C/16G",
            "用途":""
        },
        {
            "编号": "26",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db31",
            "宿主机IP":"132.63.10.32",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP1)",
            "程序路径":"/oracle oracle10g安装程序",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "27",
            "所属类别": "数据库",
            "名称": "DAP",
            "所属系统": "ODS",
            "用途": "展现数据库node1",
            "宿主机名":"dss-db41",
            "宿主机IP":"132.63.10.33",
            "OA映射地址":"",
            "宿主机用途":"汇总数据库(DAP2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora10gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "28",
            "所属类别": "数据库",
            "名称": "DW",
            "所属系统": "ODS/4G/转售",
            "用途": "测试数据库，4G开发测试库",
            "宿主机名":"dss-db32",
            "宿主机IP":"132.63.10.34",
            "OA映射地址":"",
            "宿主机用途":"宽表测试库，4G数据库(DW1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle   ctgogg",
            "系统密码":"ora10gR2  vgCLB5kl",
            "开发单位":"亚联",
            "维护负责人":"张国庆",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256GB",
            "用途":""
        },
        {
            "编号": "29",
            "所属类别": "数据库",
            "名称": "LSDB",
            "所属系统": "ODS",
            "用途": "宽表历史数据库，号码级历史库",
            "宿主机名":"dss-db42",
            "宿主机IP":"132.63.10.35",
            "OA映射地址":"",
            "宿主机用途":"历史库(lsdb)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"ora11gR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"superdome",
            "基本配置":"40C/256G",
            "用途":""
        },
        {
            "编号": "30",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node1",
            "宿主机名":"dss-db5",
            "宿主机IP":"132.63.10.63",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "31",
            "所属类别": "数据库",
            "名称": "DCA",
            "所属系统": "ODS",
            "用途": "宽表生产库node2",
            "宿主机名":"dss-db6",
            "宿主机IP":"132.63.10.64",
            "OA映射地址":"",
            "宿主机用途":"宽表数据库(DCA2)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"AIX version 6.1",
            "系统用户":"oracle",
            "系统密码":"Oracle11$",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"IBM P780",
            "基本配置":"32C/256G",
            "用途":""
        },
        {
            "编号": "32",
            "所属类别": "数据库",
            "名称": "ODS",
            "所属系统": "ODS",
            "用途": "号码级数据库/全网枢纽/X86配置库node1",
            "宿主机名":"dss-db1",
            "宿主机IP":"132.63.10.8",
            "OA映射地址":"",
            "宿主机用途":"号码级数据库(ODS1)",
            "程序路径":"/oracle oracle10g安装程序 /data 数据文件，系统表空间文件存放路径",
            "开发平台":"",
            "版本":"",
            "系统版本":"HP-UX B.11.31",
            "系统用户":"oracle",
            "系统密码":"oracleR2",
            "开发单位":"亚联",
            "维护负责人":"张思博",
            "物理地址":"亦庄",
            "主机型号":"",
            "基本配置":"",
            "用途":""
        },
    ];

    var peopleinfo = [
        {
            "编号":"1",
            "姓名":"陈靖翔",
            "办公电话":"",
            "手机号":"",
            "邮箱":"chenjx@chinatelecom.cn",
        },
        {
            "编号":"2",
            "姓名":"郭艳珍",
            "办公电话":"",
            "手机号":"",
            "邮箱":"guoyz@chinatelecom.cn",
        },
        {
            "编号":"3",
            "姓名":"黄永明",
            "办公电话":"",
            "手机号":"",
            "邮箱":"huangym@chinatelecom.cn"
        },
        {
            "编号":"4",
            "姓名":"袁辉",
            "办公电话":"",
            "手机号":"",
            "邮箱":"yuanhui@chinatelecom.cn"
        },
        {
            "编号":"5",
            "姓名":"刘超",
            "办公电话":"",
            "手机号":"",
            "邮箱":"liuchao@chinatelecom.cn",
        },
        {
            "编号":"6",
            "姓名":"刘韵雅",
            "办公电话":"",
            "手机号":"",
            "邮箱":"liuyunya@chinatelecom.cn",
        },
        {
            "编号":"7",
            "姓名":"李念",
            "办公电话":"",
            "手机号":"",
            "邮箱":"linian@chinatelecom.cn",
        },
        {
            "编号":"8",
            "姓名":"刘峻岭",
            "办公电话":"",
            "手机号":"",
            "邮箱":"liujunling@chinatelecom.cn",
        },
        {
            "编号":"9",
            "姓名":"张苗苗",
            "办公电话":"",
            "手机号":"",
            "邮箱":"zhangmm1@chinatelecom.cn",
        },
        {
            "编号":"10",
            "姓名":"郑京生",
            "办公电话":"",
            "手机号":"",
            "邮箱":"zhengjsh@chinatelecom.cn"
        },
        {
            "编号":"11",
            "姓名":"王聿达",
            "办公电话":"",
            "手机号":"",
            "邮箱":"wangyuda@chinatelecom.cn"
        },
        {
            "编号":"12",
            "姓名":"李芊蒴",
            "办公电话":"",
            "手机号":"",
            "邮箱":"liqsh@chinatelecom.cn"
        },
        {
            "编号":"13",
            "姓名":"张涛",
            "办公电话":"",
            "手机号":"",
            "邮箱":"zhangt@chinatelecom.cn"
        },
    ]


    $scope.gridOptions.data = yizhuang;

    $scope.gridOptions.change = function(tablename) {

        var txt = $('#'+tablename).text();
        if (txt === '亦庄资源') {
            var tmp = $('#Table1').text();
            $('#Table1').text(txt);
            $('#'+tablename).text(tmp);

            $scope.gridOptions.data = yizhuang;

            $scope.gridOptions.columnDefs = [
                {
                    name: '编号',
                    width: 100
                },
                {
                    name: '所属类别',
                    width: 100
                },
                {
                    name: '名称',
                    width: 100
                },
                {
                    name: '所属系统',
                    width: 100
                },
                {
                    name: '用途',
                    width: 100
                },
                {
                    name: '宿主机名',
                    width: 100
                },
                {
                    name: '宿主机IP',
                    width: 100
                },
                {
                    name: 'OA映射地址',
                    width: 100
                },
                {
                    name: '宿主机用途',
                    width: 100
                },
                {
                    name: '程序路径',
                    width: 100
                },
                {
                    name: '开发平台',
                    width: 100
                },
                {
                    name: '版本',
                    width: 100
                },
                {
                    name: '系统版本',
                    width: 100
                },
                {
                    name: '系统用户',
                    width: 100
                },
                {
                    name: '系统密码',
                    width: 100
                },
                {
                    name: '开发单位',
                    width: 100
                },
                {
                    name: '维护负责人',
                    width: 100
                },
                {
                    name: '物理地址',
                    width: 100
                },
                {
                    name: '主机型号',
                    width: 100
                },
                {
                    name: '基本配置',
                    width: 100
                },
                {
                    name: '用途',
                    width: 100
                }

            ]
        } else if (txt === '运营维护处人员信息') {
            var tmp = $('#Table1').text();
            $('#Table1').text(txt);
            $('#'+tablename).text(tmp);

            $scope.gridOptions.data = peopleinfo;
            $scope.gridOptions.columnDefs = [
                {
                    name: '编号',
                    width: 100
                },
                {
                    name: '姓名',
                    width: 100
                },
                {
                    name: '办公电话',
                    width: 100
                },
                {
                    name: '手机号',
                    width: 100
                },
                {
                    name: '邮箱',
                    width: 200
                },

            ]
        }




    }
});